[
  {
    "work_id": 1,
    "work_name": "Booki",
    "work_cover": "https://i.imgur.com/XV2L1xI.png",
    "work_year": 2023,
    "work_repo": "https://github.com/Jumic14/Booki/",
    "work_url": "hthttps://booki-jm.vercel.app/",
    "work_context": "Formation Développeur Web OpenClassrooms - Projet 2",
    "work_intro": "Création de la page d'accueil d'une agence de voyage avec HTML et CSS",
    "work_desc": "Premier projet de la formation : créer une page web statique et responsive. Découvert des langages HTML et CSS, ainsi que VSCode, Git, GitHub et Figma.",
    "work_context_en": "OpenClassrooms Web Developer Training Program - Project 2",
    "work_intro_en": "Creating the homepage of a travel agency with HTML and CSS",
    "work_desc_en": "First project of the training: create a static and responsive web page. Learn HTML and CSS languages, as well as VSCode, Git, GitHub, and Figma.",
    "work_category": 2
  },
  {
    "work_id": 2,
    "work_name": "Sophie Bluel - Architecte d'intérieur",
    "work_cover": "https://i.imgur.com/x8OUVUW.png",
    "work_year": 2023,
    "work_repo": "https://github.com/Jumic14/Portfolio-architecte-sophie-bluel",
    "work_url": "",
    "work_context": "Formation Développeur Web OpenClassrooms - Projet 3",
    "work_intro": "Création d'une page web dynamique avec JavaScript",
    "work_desc": "Initiation à JavaScript et Node.js avec pour objectif de permettre à la cliente fictive, Sophie Bluel, de se connecter à son portfolio depuis une page statique. Elle pourra gérer ses projets via une modale, y ajoutant, supprimant ou modifiant leur affichage.",
    "work_context_en": "OpenClassrooms Web Developer Training Program - Project 3",
    "work_intro_en": "Creating a dynamic web page with JavaScript",
    "work_desc_en": "Introduction to JavaScript and Node.js with the goal of enabling the fictional client, Sophie Bluel, to log in to her portfolio from a static page. She will be able to manage her projects through a modal, adding, deleting, or adjusting their display.",
    "work_category": 2
  },
  {
    "work_id": 3,
    "work_name": "Kasa",
    "work_cover": "https://i.imgur.com/3ayxAZk.png",
    "work_year": 2023,
    "work_repo": "https://github.com/Jumic14/kasa",
    "work_url": "https://kasa-jm.vercel.app/",
    "work_context": "Formation Développeur Web OpenClassrooms - Projet 6",
    "work_intro": "Création d'une application web de location immobilière avec React",
    "work_desc": "Découverte de React dans ce projet de formation pour développer une application responsive et fonctionnelle avec le backend fourni. Comprend une page d'accueil pour les logements, des pages de présentation pour chaque logement et une pour Kasa.",
    "work_context_en": "OpenClassrooms Web Developer Training Program - Project 6",
    "work_intro_en": "Building a real estate rental web application with React",
    "work_desc_en": "Introduction to React in this training project aimed at developing a responsive and functional application with the provided backend. It includes a homepage for accommodations, presentation pages for each accommodation, and one for Kasa.",
    "work_category": 2
  },
  {
    "work_id": 4,
    "work_name": "Mon Vieux Grimoire",
    "work_cover": "https://i.imgur.com/yOVSHeo.png",
    "work_year": 2023,
    "work_repo": "https://github.com/Jumic14/mon-vieux-grimoire",
    "work_url": "",
    "work_context": "Formation Développeur Web OpenClassrooms - Projet 7",
    "work_intro": "Développement du backend d'un site de notation de livres",
    "work_desc": "L'objectif est de créer la partie backend d'une application, avec un serveur Node, Express, et une base de données MongoDB. Les fonctionnalités incluent l'authentification, la gestion des livres (ajout, modification, suppression), et une fonctionnalité de notation pour calculer la moyenne.",
    "work_context_en": "OpenClassrooms Web Developer Training Program - Project 7",
    "work_intro_en": "Backend development for a book rating website",
    "work_desc_en": "The goal is to develop the backend part of an application, including a Node server, Express, and a MongoDB database. Features include authentication, book management (addition, modification, deletion), and a rating functionality for calculating the average.",
    "work_category": 1
  },
  {
    "work_id": 5,
    "work_name": "Portfolio-JM",
    "work_cover": "https://i.imgur.com/ZDQmfWa.png",
    "work_year": 2023,
    "work_repo": "https://github.com/Jumic14/Portofolio-JM",
    "work_url": "https://jumic14.github.io/Portfolio-JM/",
    "work_context": "Formation Développeur Web OpenClassrooms - Projet 8",
    "work_intro": "Création d'un portfolio de développeur",
    "work_desc": "Dernier projet de formation, création d'un site personnel. Il présente mon parcours, mes compétences, certifications et projets, et inclut un formulaire de contact. Grandement inspiré du projet \"Kasa\", ce portfolio est toujours en ligne, mais n'est plus mis à jour.",
    "work_context_en": "OpenClassrooms Web Developer Training Program - Project 8",
    "work_intro_en": "Creating a developer's portfolio",
    "work_desc_en": "Last training project: creating a personal website. It includes background, skills, certifications, projects, and a contact form. Heavily inspired by the \"Kasa\" project, this portfolio remains online but is no longer updated.",
    "work_category": 2
  },
  {
    "work_id": 6,
    "work_name": "Celestial Observatory",
    "work_cover": "https://i.imgur.com/PL9VV1d.png",
    "work_year": 2024,
    "work_repo": "https://github.com/Jumic14/celestial-observatory",
    "work_url": "https://celestial-observatory.vercel.app/",
    "work_context": "Apprentissage Angular - projet personnel",
    "work_intro": "Création d'une application de vulgarisation astronomique avec Angular",
    "work_desc": "Celestial Observatory est une application web responsive développée avec Angular, offrant un suivi en temps réel de l'ISS, une liste détaillée des astres du système solaire avec leurs caractéristiques, et une galerie d'images de la NASA. Disponible en français et anglais.",
    "work_context_en": "Angular training - Personal project",
    "work_intro_en": "Creating an astronomy education application using Angular",
    "work_desc_en": "Celestial Observatory is a responsive web application developed with Angular, providing real-time tracking of the ISS, a detailed list of celestial bodies in the solar system with their characteristics, and a gallery of images from NASA archives. Available in French and English.",
    "work_category": 2
  },
  {
    "work_id": 7,
    "work_name": "V2 Jumic",
    "work_cover": "https://i.imgur.com/hfnQzFU.png",
    "work_year": 2024,
    "work_repo": "https://github.com/Jumic14/v2.jumic-front",
    "work_url": "https://v2.jumic.vercel.app/",
    "work_context": "Apprentissage Angular - projet personnel",
    "work_intro": "Refonte de mon site personnel",
    "work_desc": "Version MEAN Stack de mon site personnel, le site est disponible en français et en anglais, et le design est optimisé pour des écrans allant de 300 à 3000 pixels.",
    "work_context_en": "Angular training - Personal project",
    "work_intro_en": "Redesign of my personal website",
    "work_desc_en": "MEAN Stack version of my personal website, the website is available in French and English, and the design is optimized for screens ranging from 300 to 3000 pixels.",
    "work_category": 2
  }
]
